Конфигурация/Reports/РасшифровкаРасчетаАмортизацииДисконтаПремииИКорректировкиПоЭСП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>РасшифровкаРасчетаАмортизацииДисконтаПремииИКорректировкиПоЭСП</Name>
		</Properties>
	</Report>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатистикаРаботыВнутреннихМеханизмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаРаботыВнутреннихМеханизмов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачалоМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончаниеМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПараметрыВыполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сеанс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СессияЗавершенаСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Механизм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаВыполнения</Name>
					<Comment>Должна соответствовать дате из ПериодВыполненияНачало. Служит для групповой обработки записей</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Reports/РасшифровкаРасчетаАмортизацииДисконтаПремииИКорректировкиПоЭСП/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЦеннаяБумага") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры,, "ТолькоПросмотр,ЗакрыватьПриВыборе,ЗакрыватьПриЗакрытииВладельца");
		СформироватьНаСервере(Отказ);
	Иначе
		ЭтаФорма.Организация   = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере(Отказ = Ложь)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Механизм = "Отчет.РасшифровкаРасчетаАмортизацииДисконтаПремииИКорректировкиПоЭСП.Форма.СформироватьНаСервере()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтаФорма, "ДатаПереоценки,Организация,СчетДоверительногоУправления");//, Новый Структура("ДатаПереоценки,Организация,СчетДоверительногоУправления", ЭтаФорма.ДатаПереоценки, ЭтаФорма.Организация, ЭтаФорма.СчетДоверительногоУправления));
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Результат.Очистить();
	
	НастройкиУчетаОбщие = БухгалтерскийУчет.ОпределитьНастройкиУчета(ЭтаФорма.ДатаПереоценки, ЭтаФорма.Организация, ЭтаФорма.СчетДоверительногоУправления);
	
	//Если это первая переоценка до начала ведения учета
	Если НЕ ЗначениеЗаполнено(НастройкиУчетаОбщие.ВестиЕдиныйБухгалтерскийУчет) Тогда
		НастройкиУчетаОбщие = БухгалтерскийУчет.ОпределитьНастройкиУчета(ЭтаФорма.ДатаПереоценки + 86400, ЭтаФорма.Организация, ЭтаФорма.СчетДоверительногоУправления);
		Если НЕ ЗначениеЗаполнено(НастройкиУчетаОбщие.ВестиЕдиныйБухгалтерскийУчет) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На дату переоценки не ведется единый бухгалтерский учет!",,,,);
			Возврат;
		КонецЕсли;
	КонецЕсли;		
	
	НастройкиУчетаЦеннойБумаги = БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(
		НастройкиУчетаОбщие,
		ЭтаФорма.ЦеннаяБумага,
		ЭтаФорма.УчетныйАктивЕПС,
		ЭтаФорма.Партия,
		ЭтаФорма.СтрокаПартии);

	Биржа = ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ");
	
	ЦеннаяБумага = ЭтаФорма.ЦеннаяБумага;
	Партия 		 = ЭтаФорма.Партия;
	СтрокаПартии = ЭтаФорма.СтрокаПартии;
	УчетныйАктивЕПС = ЭтаФорма.УчетныйАктивЕПС;

	РаботаСОтчетами.КонтрольВалютыРасходовПоСделкамОтличнойОтВалютыУчета(ЭтаФорма.СчетДоверительногоУправления,,, Партия);
	
	МассивТиповПартий = Новый Массив;
	МассивТиповПартий.Добавить(Тип("ДокументСсылка.Сделка"));
	МассивТиповПартий.Добавить(Тип("ДокументСсылка.СделкаРЕПО"));
	МассивТиповПартий.Добавить(Тип("ДокументСсылка.ИсполнениеОбязательствПоСделке"));
	МассивТиповПартий.Добавить(Тип("ДокументСсылка.ПоставкаЦенныхБумаг"));
	МассивТиповПартий.Добавить(Тип("ДокументСсылка.ВводЦенныхБумаг"));
	МассивТиповПартий.Добавить(Тип("ДокументСсылка.КорректировкаРегистров"));
	МассивТиповПартий.Добавить(Тип("ДокументСсылка.РеклассификацияАктивовЕПС"));
	
	ЦенныеБумаги = Новый ТаблицаЗначений;
	
	ЦенныеБумаги.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ЦенныеБумаги.Колонки.Добавить("ЦеннаяБумага", Новый ОписаниеТипов("СправочникСсылка.Облигации"));
	ЦенныеБумаги.Колонки.Добавить("Партия",  Новый ОписаниеТипов(МассивТиповПартий));
	ЦенныеБумаги.Колонки.Добавить("СтрокаПартии", Новый ОписаниеТипов("Число"));
	ЦенныеБумаги.Колонки.Добавить("УчетныйАктивЕПС", Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивыЕПС"));
	ЦенныеБумаги.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	СтрокаЦенныеБумаги = ЦенныеБумаги.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаЦенныеБумаги, ЭтаФорма);
	СтрокаЦенныеБумаги.НомерСтроки = 1;
	
	ДатыИЦеныПокупки = БухгалтерскийУчетЕПС.ПолучитьДатыИЦеныПокупки(ЦенныеБумаги, ЭтаФорма.СчетДоверительногоУправления, ЭтаФорма.ДатаПереоценки).Выгрузить();
	
	ДатаИЦенаПокупки = ДатыИЦеныПокупки.НайтиСтроки(Новый Структура("НомерСтроки", 1));
	
	НачальныйДисконт 			= ДатаИЦенаПокупки[0].НачальныйДисконт;
	ЦенаПокупки 				= ДатаИЦенаПокупки[0].ЦенаПокупки;
	ЦенаПокупкиКупона 			= ДатаИЦенаПокупки[0].ЦенаКупона;
	ДатаПокупки 				= ДатаИЦенаПокупки[0].ДатаПокупки;
	ДатаПокупкиНачальная		= ДатаИЦенаПокупки[0].ДатаПокупкиНачальная;
	КорректировкаЭСПНачальная	= ДатаИЦенаПокупки[0].КорректировкаЭСПНачальная;
	Партия		 				= ДатаИЦенаПокупки[0].Партия;
	ЦенаПокупкиНачальная		= ДатаИЦенаПокупки[0].ЦенаПокупкиНачальная;
	
	// у клиента не считается ЭСП
	Если НастройкиУчетаЦеннойБумаги.ВариантУчетаКупонногоДохода <> Перечисления.ВариантыУчетаПроцентныхДоходов.ПоЭффективнойСтавке Тогда
		// по всем, кроме "через прибыль/убыток" считаем Корректировку ЭСП независимо от настроек
		Если УчетныйАктивЕПС.Родитель <> Справочники.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток Тогда
			НастройкиУчетаЦеннойБумаги.ВариантУчетаКупонногоДохода = Перечисления.ВариантыУчетаПроцентныхДоходов.ПоЭффективнойСтавке;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеПереоценки = Новый Структура("ДатаПереоценки, Количество, ОценочнаяСуммаКупона, БалансовыйДисконт, УчетныйАктивЕПС, Партия, СтрокаПартии, Стоимость");
	ЗаполнитьЗначенияСвойств(ДанныеПереоценки, ЭтаФорма, "ДатаПереоценки, Количество, ОценочнаяСуммаКупона, БалансовыйДисконт, УчетныйАктивЕПС, Партия, СтрокаПартии, Стоимость");
	ДанныеПереоценки.Вставить("БалансоваяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", ЭтаФорма.БалансоваяРазницаППНеНаблюдаемыеДанные);
	ДанныеПереоценки.Вставить("СчетДоверительногоУправления", ЭтаФорма.СчетДоверительногоУправления);
	
	ДанныеПокупки = Новый Структура("НачальныйДисконт,ДатаПокупки,ДатаПокупкиНачальная,КорректировкаЭСПНачальная,ЦенаПокупки,ЦенаПокупкиНачальная");
	ЗаполнитьЗначенияСвойств(ДанныеПокупки, ДатаИЦенаПокупки[0], "НачальныйДисконт,ДатаПокупки,ДатаПокупкиНачальная,КорректировкаЭСПНачальная,ЦенаПокупки,ЦенаПокупкиНачальная");
	ДанныеПокупки.Вставить("НачальнаяРазницаПервоначальногоПризнанияНеНаблюдаемыеДанные", НачальнаяРазницаППНеНаблюдаемыеДанные / ЭтаФорма.Количество);
	ДанныеПокупки.Вставить("ЦенаПокупкиКупона", ЦенаПокупкиКупона);

	РасшифровкаРасчета = Новый Структура;
	РасшифровкаРасчета.Вставить("ЦеннаяБумага",	ЦеннаяБумага);
	РасшифровкаРасчета.Вставить("Операции",		Новый Массив);
	
	БухгалтерскийУчетЕПС.РассчитатьАмортизациюДисконтаПремииИКорректировкуПоЭСПИРазницуПервоначальногоПризнания(ЦеннаяБумага, ДанныеПереоценки, ДанныеПокупки, НастройкиУчетаЦеннойБумаги, Отказ, РасшифровкаРасчета);
	
	Если РасшифровкаРасчета.Операции.Количество() > 0 Тогда	
	
		ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент("Расшифровка расчета процентных показателей: " + Строка(ЦеннаяБумага),,, Результат);
		ПараметрыВывода.Вставить("СобственныйФорматСтрок", Истина);
		
		РаботаСДокументами.СформироватьРасшифровкуОперации(РасшифровкаРасчета, ПараметрыВывода);
		
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры
